 <ul>
               <li>Σύνδεση του Διαχειριστή, Υπαλλήλου, Πελάτη. </li>
               <li>Προσθήκη Παραλήπτη απο τον Λογαριασμό του Πελάτη.</li>
                <li>Μεταφορά Κεφαλαίου στον Παραλήπτη απο τον Πελάτη. </li>
               <li>Υπάλληλος πρέπει να εγκρίνει την μεραφορά πρίν αυτή πραγματοποιηθεί. </li>
               <li>Ο πελάτης(καταθέτης) μπορεί να δεί την τελευταία φορά που συνδέθηκε.</li>
               <li>Ο πελάτης μπορεί να δεί τις 10 τελευταίες συναλλαγές του.</li>
               <li>Ο πελάτης μπορεί να δεί τις συναλλαγές του σε ένα εύρος χρόνου.</li>
               <li>Ο πελάτης μπορεί να κάνει αίτηση για κάρτα και βιβλιάριο επιταγών.</li>
               <li>Υπαλληλος μπορεί να αποδεχθεί τις αιτήσεις το πελάτη. </li>
              <li>Ο διαχειριστής μπορεί να προσθέσει/τροποποιήσει/διαγράψει πελάτες και προσωπικό. </li>
             <li>Όλες οι οντότητες μπορούν να αλλάξουν τον κωδικό τους. </li>
             <li>Οι κωδικοί περνάν απο συνάρτηση σύνοψης μαζί με ένα τυχαίο salt για έξτρα ασφάλεια.</li>
 </ul>
